/*****************************************
 *  mahjong_create_room_static.js
    自建桌 用到的静态共享数据
 *  mahjong
 *
 *  Created by nick.kai.lee on 16-06-22
 *  特殊说明：
 */

(function(){
    var GLOBAL_OBJ = guiyang;
    GLOBAL_OBJ.businesses.scenes.CustomRoom.static = {
        _TAG: 'GLOBAL_OBJ.businesses.scenes.CustomRoom.static',
      
        WXKEY:"wechatkey",
        
        // NOTICE 自建桌 玩法的列表，对应的资源是在这里取的
        BUTTONS:{
            //ADDNEW
            // baicheng: "baicheng",
            wuhan   : "wuhan",
        },

        NAMES:{
            //ADDNEW
            // baicheng:"白城麻将",
            wuhan             :"武汉麻将",
            kawuxingxiangyang : "卡五星-襄阳",
        },

        ACTIONS:{
            INFO:"info",
            SIT:"sit",
            READY:"ready",
            LEAVE:"leave",
            RECORD:"record",
        },
 
        //pk modify:暂时的玩法说明文本配置
        /*左边的按钮配置*/
        tempRulesConfig:[
            // "baicheng",
            "wuhan",
            //"jindiandoudizhu",
            //"errendoudizhu",
        ],
        /*有边的文本配置：当前只有content 和 font 有用 */
        TEXTS:{  // 微信信息key
            basic:[
                { content:"基础规则：", font:"Arial-BoldMT", size:35, color:cc.color(195,135,77) },
                { content:"胡：存在一对将，其余牌能组成刻或顺或杠。", font:"Arial", size:30, color:cc.color(195,135,77) },
                { content:"牌：分条，筒，万，字，风五种花色。", font:"Arial", size:30, color:cc.color(195,135,77) },
                { content:"刻：三张一样的牌。", font:"Arial", size:30, color:cc.color(195,135,77) },
                { content:"顺：三张顺着的牌。", font:"Arial", size:30, color:cc.color(195,135,77) },
                { content:"杠：四张一样的牌。", font:"Arial", size:30, color:cc.color(195,135,77) },
                { content:"将：两张一样的牌。", font:"Arial", size:30, color:cc.color(195,135,77) },
                { content:"吃：得到上家打出的一张牌后能组成顺，可吃。", font:"Arial", size:30, color:cc.color(195,135,77) },
                { content:"碰：得到其他家打出的一张牌后能组成刻，可碰。", font:"Arial", size:30, color:cc.color(195,135,77) },
                { content:"杠：已有一副刻牌，再得到一张，可杠。", font:"Arial", size:30, color:cc.color(195,135,77) },
            ],
            wuhan:[
                { content :"【基本规则】"},
                { content :"1、用牌：万、筒、条、东、南、西、北、中、发、白，共136张牌；"},
                { content :"2、定庄：逆时针上家轮庄，庄家和牌或荒庄（流局）则继续做庄；"},
                { content :"3、赖子皮：所有玩家起牌后再翻出一张牌，这张牌及这张牌的上一张牌被称为“赖子皮”。赖子皮只能杠，不能参与胡牌、也不能吃、碰、暗杠；"},
                { content :"4、红中皮：无论任何情况，红中的作用和癞子皮都是一致的。也可以把红中视为固定的赖子皮。意味着红中不参与“风”这一门花色的赖子及赖子皮排序。红中也不能成为赖子；"},
                { content :"5、发财皮：无论任何情况，发财的作用和癞子皮都是一致的。也可以把发财视为固定的赖子皮。意味着发财不参与“风”这一门花色的赖子及赖子皮排序。发财不能成为赖子；"},
                { content :"6、赖子：所有玩家起牌后再翻出一张牌，这张牌的下一张牌称为“赖子”。赖子可以当任何牌使用；"},
                { content :""},
                { content :"【和牌规则】"},
                { content :"1. 基本牌型：一对将牌，和４个刻或坎，除风一色、将一色、清一色、碰碰胡外，一对必须是２、５、８，比如２万、５筒、８条等。风一色、将一色、为乱风乱将，手上全是封牌或将牌即可和牌；"},
                { content :"2. 开口且满足起胡番数要求才能胡牌，不同场次的起胡番数不同，以具体场次为准；"},
                { content :"3. 当两个或以上赖子时不能胡屁胡，但可以大胡；"},
                { content :"4. 在红中赖子杠玩法中，和牌时手牌中不能有红中；"},
                { content :"5. 在七皮四赖玩法中，和牌时手牌中不能有赖子皮；"},
                { content :"6. 允许截胡，即一盘仅一个人能胡。当同时有超过１人可胡时，以庄家逆时针为序确认和牌人；"},
                { content :""},
                { content :"【番型计分】"},
                { content :"1、【开口】X2             吃、碰、明杠称为开口，必须开口才能胡，即必须有吃、碰、或明杠行为。口口番中每开一次口都X2；"},
                { content :"2、【硬屁胡】X4             胡牌时手中没有赖子，或有赖子但赖子为本身的牌组成的牌型，为硬胡。在风一色中，若赖子是风字，在将一色中，若赖子是2、5、8数字也都算“硬胡”；"},
                { content :"3、【软屁胡】X2             胡牌时手牌中有赖子，且赖子不为本身的字的牌型，为软胡；"},
                { content :"4、【屁胡】X2             一对将，和4个刻字或坎，其中必须用2、5、8的对子做将牌；"},
                { content :"5、【大胡番型】X10         可累计，分为软大胡和硬大胡；"},
                { content :"碰碰胡、风一色、将一色、清一色，本身可以成胡，不需要258将；"},
                { content :"【碰碰胡】                  除将牌外均为刻子；任意将；"},
                { content :[11,11,11,0,12,12,12,0,13,13,13,0,21,21,0,22,22,0,22]},
                { content :"【风一色 】                 胡牌时，手中全部为风牌，无需凑坎，允许有赖子；"},
                { content :[31,31,31,0,32,32,33,0,34,34,36,0,37,37,37,37,0,36]},
                { content :"【将一色】                  胡牌时，手中全部为2、5、8，无需凑坎，允许有赖子"},
                { content :[12,12,12,0,25,25,25,0,5,5,5,5,15,15,18,0,8]},
                { content :"【清一色】                  胡牌时，手中全部为同一花色（万、筒、条），牌型需要成胡，允许有赖子；"},
                { content :[11,11,12,12,13,13,13,14,14,15,16,17,18,19,0,14]},
                { content :"【全求人】                   手中的手牌，全部吃、碰、杠（暗杠不算）最后只剩下一张手牌时，由其他人放铳胡牌。"},
                { content :[12,12,12,0,21,22,23,0,14,14,14,0,17,17,17,0,8,0,8]},
                { content :"【杠开】                    开杠时杠来的一张牌胡牌。"},
                { content :[12,12,12,0,21,22,23,0,25,25,25,0,17,17,17,17,0,8,0,8]},
                { content :""},
                { content :"【包胡规则】"},
                { content :"1、玩家A胡牌且胡牌牌型为“清一色”，则该盘玩家A赢的其他三位玩家的分数由玩家B一人支付。"},
                { content :"2、下大雨：当玩家B包胡玩家A时（打出第三句让玩家A碰、杠、吃），玩家B、玩家C、玩家D必须将自己手中玩家A包胡的类型打出，否则包胡的对象就会转移到手中有此花色而没有打出的人，一直到牌局结束。最后哪位玩家没有打包胡的同门花色，哪位玩家包胡。"},
                { content :""},
                { content :"【特殊规则】"},
                { content :"【七皮四赖玩法】："},
                { content :"基础规则与红中赖子杠相似。区别在于红中赖子杠固定“红中”为杠牌，而七皮四赖玩法每局重新定赖子皮为杠。"},
                { content :""},
                { content :"【赖子皮】："},
                { content :"三个闲家抓完13张牌、庄家抓完第14张牌后翻出的第一张牌为“赖子皮”，该牌的上一张也是赖子皮，下一张为“赖子“。"},
                { content :"举例：如翻出的牌是“9万”，则赖子皮是8万和9万，1万为赖子"},
                { content :""},
                { content :"【计分规则】"},
                { content :"1、没有包胡时，1家胡牌，3家输分，没放冲的玩家也需要进行结算"},
                { content :"2、有包胡时，1家需要承担所有输分"},
                { content :"3、输分=底分*自己的倍数*赢家底倍"},
                { content :"4、开口X2、暗杠X4、蓄杠X4、点杠X4、赖子皮杠X2、赖子杠X2、自摸X2、屁胡，庄家的输或赢均单独X2、屁胡：软屁胡X2、硬屁胡X4、大胡：软大胡X10、硬大胡X20"},
            ],
        },
    };
})();